11/data/attachments/94b69087ab678096.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_9f3692d2-b0b2-4737-bae9-628b470a21ee</nif:username>
            <nif:friendToBeAdded>Heidi_happen_Friend_21081_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>